/****************************************Copyright (c)***************************************
**                                  常州汇邦电子有限公司
**
**                                 http://www.cnwinpark.cn
**
**
**--------------文件信息---------------------------------------------------------------------
** 文 件 名:    key_queue.c
** 修改日期:    2017-12-30
** 上个版本:
** 描    述:
**
**-------------------------------------------------------------------------------------------
** 创    建:    JianHang
** 创建日期:    2017-12-30
** 版    本:    1.0
** 描    述:    按键队列
**
**-------------------------------------------------------------------------------------------
** 修    改:
** 修改日期:
** 版    本:
** 描    述:
**
*********************************************************************************************/
#include "key_event.h"
#include "key_queue.h"

/********************************************************************************************
* 函数名称：Key_Queue_Init
* 功能说明：按键队列相关配置初始化
* 输入参数：queue ：         按键队列管理结构体
*           event_buffer ：  队列缓冲区
*           size ：          队列缓冲区长度
* 输出参数：1 ：初始化成功
*           0 ：初始化失败
* 其它说明：无
*********************************************************************************************/
int8_t Key_Queue_Init(key_queue_t* queue, key_event_t* event_buffer, uint8_t size)
{
    if ((queue == NULL) || (event_buffer == NULL) || (size == 0))
    {
        return 0;
    }

    queue->event_buffer = event_buffer;
    queue->size = size;
    queue->head = 0;
    queue->tail = 0;
    queue->len = 0;

    return 1;
}

/********************************************************************************************
* 函数名称：Key_Enqueue
* 功能说明：按键队列入队
* 输入参数：queue ：          按键队列管理结构体
*           event ：          入队成员
* 输出参数：1 ：入队成功
*           0 ：入队失败
* 其它说明：无
*********************************************************************************************/
int8_t Key_Enqueue(key_queue_t* queue, key_event_t* event)
{
    if ((queue == NULL) || (event == NULL))
    {
        return 0;
    }

    key_queue_t* que = (key_queue_t*)queue;

    if (que->len < que->size)
    {
        que->len++;
        que->event_buffer[que->tail] = *event;

        if (que->tail == (que->size - 1))
        {
            que->tail = 0;
        }
        else
        {
            que->tail++;
        }

        return 1;
    }

    return 0;
}

/********************************************************************************************
* 函数名称：Key_Dequeue
* 功能说明：按键队列出队
* 输入参数：queue ：          按键队列管理结构体
*           event ：          出队成员
* 输出参数：1 ：出队成功
*           0 ：出队失败
* 其它说明：无
*********************************************************************************************/
int8_t Key_Dequeue(key_queue_t* queue, key_event_t* event)
{
    if ((queue == NULL) || (event == NULL))
    {
        return 0;
    }

    key_queue_t* que = (key_queue_t*)queue;

    if (que->len)
    {
        que->len--;
        *event = que->event_buffer[que->head];

        if (que->head == (que->size - 1))
        {
            que->head = 0;
        }
        else
        {
            que->head++;
        }

        return 1;
    }

    return 0;
}

/********************************************************************************************
* 函数名称：Key_Queue_Clr
* 功能说明：按键队列清缓存
* 输入参数：queue ：          按键队列管理结构体
* 输出参数：无
* 其它说明：无
*********************************************************************************************/
void Key_Queue_Clr(key_queue_t* queue)
{
    queue->head = queue->tail = 0;
    queue->len = 0;
}





















