/****************************************Copyright (c)***************************************
**                                  常州汇邦电子有限公司
**
**                                 http://www.cnwinpark.cn
**
**
**--------------文件信息---------------------------------------------------------------------
** 文 件 名:    key_queue.h
** 修改日期:    2017-12-30
** 上个版本:
** 描    述:
**
**-------------------------------------------------------------------------------------------
** 创    建:    JianHang
** 创建日期:    2017-12-30
** 版    本:    1.0
** 描    述:    按键队列
**
**-------------------------------------------------------------------------------------------
** 修    改:
** 修改日期:
** 版    本:
** 描    述:
**
*********************************************************************************************/
#ifndef KEY_QUEUE_H
#define KEY_QUEUE_H

#include "..\service_cfg.h"
#include "key_event.h"

/*
    按键队列管理结构体定义
*/
typedef struct key_queue key_queue_t;
struct key_queue {
    uint8_t head;
    uint8_t tail;
    uint8_t size;
    uint8_t len;
    key_event_t* event_buffer;
};

/********************************************************************************************
* 函数名称：Key_Queue_Init
* 功能说明：按键队列相关配置初始化
* 输入参数：queue ：         按键队列管理结构体
*           event_buffer ：  队列缓冲区
*           size ：          队列缓冲区长度
* 输出参数：1 ：初始化成功
*           0 ：初始化失败
* 其它说明：无
*********************************************************************************************/
extern int8_t Key_Queue_Init(key_queue_t* queue, key_event_t* event_buffer, uint8_t size);

/********************************************************************************************
* 函数名称：Key_Enqueue
* 功能说明：按键队列入队
* 输入参数：queue ：          按键队列管理结构体
*           event ：          入队成员
* 输出参数：1 ：入队成功
*           0 ：入队失败
* 其它说明：无
*********************************************************************************************/
extern int8_t Key_Enqueue(key_queue_t* queue, key_event_t* event);

/********************************************************************************************
* 函数名称：Key_Dequeue
* 功能说明：按键队列出队
* 输入参数：queue ：          按键队列管理结构体
*           event ：          出队成员
* 输出参数：1 ：出队成功
*           0 ：出队失败
* 其它说明：无
*********************************************************************************************/
extern int8_t Key_Dequeue(key_queue_t* queue, key_event_t* event);

/********************************************************************************************
* 函数名称：Key_Queue_Clr
* 功能说明：按键队列清缓存
* 输入参数：queue ：          按键队列管理结构体
* 输出参数：无
* 其它说明：无
*********************************************************************************************/
extern void Key_Queue_Clr(key_queue_t* ptQueue);

#endif
